Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldNDTInspectionEnum Enumeration
 The weld NDT inspection level.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldNDTInspectionEnum
Public Enumeration WeldNDTInspectionEnum
Members
Member name | Value | Description
WELD_NDT_INSPECTION_NONE | 0 |  No NDT inspection level.
WELD_NDT_INSPECTION_A | 1 |  The NDT inspection level A.
WELD_NDT_INSPECTION_B | 2 |  The NDT inspection level B.
WELD_NDT_INSPECTION_C | 3 |  The NDT inspection level C.
WELD_NDT_INSPECTION_D | 4 |  The NDT inspection level D.
WELD_NDT_INSPECTION_E | 5 |  The NDT inspection level E.
See Also
Reference
Tekla.Structures.Model Namespace